{
  "name": "Rodrigo",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Rodrigo Mattar",
  "headerTaglineThree": "Computer Engineer and Full Stack Developer",
  "headerTaglineFour": " based in Sao Paulo, Brazil.",
  "showCursor": true,
  "showBlog": true,
  "darkMode": true,
  "showResume": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/digomatar21"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/rodrigo-mattar-216325160"
    },
    { "id": "3", "title": "Email", "link": "mailto:digomattar@gmail.com" }
  ],
  "projects": [
    {
      "id": "1",
      "title": "Project One Test",
      "description": "Web Design",
      "imageSrc": "https://images.unsplash.com/photo-1487837647815-bbc1f30cd0d2?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njl8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60",
      "url": "http://chetanverma.com/"
    },
    {
      "id": "2",
      "title": "Project Two",
      "description": "Web Development",
      "imageSrc": "https://images.unsplash.com/photo-1605153864431-a2795a1b2f95?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8MXwyNTY3ODl8fGVufDB8fHw%3D&auto=format&fit=crop&w=400&q=60",
      "url": "http://chetanverma.com/"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Web Development Services",
      "description": "As a web developer specializing in React.js and JavaScript, I provide modern and responsive web solutions tailored to clients' unique needs. I am passionate about delivering efficient and high-quality code that ensures a seamless user experience. With a focus on innovation and attention to detail, I work closely with clients to bring their visions to life, providing a range of services that exceed expectations"
    },
    {
      "id": "2",
      "title": "Infrastucture Services",
      "description": "As an experienced IAC service provider, I specialize in delivering high-performance and high-availability servers that are scalable and reliable. I work closely with clients to tailor solutions to their specific needs, ensuring optimal performance and user experience."
    },
    {
      "id": "3",
      "title": "Backend Services",
      "description": "As a developer specializing in backend with Node.js and TypeScript, I provide scalable and efficient solutions to meet the needs of modern backend applications. I am passionate about developing reliable and high-performing microservices that enable seamless communication between different components of an application. With a focus on innovation and attention to detail, I work closely with clients to bring their visions to life, delivering exceptional results that exceed expectations."
    }
  ],
  "aboutpara": "As a computer engineer, I am always eager to learn new things and expand my knowledge in various areas, including cyber security, web development, and infrastructure. I have a strong passion for developing secure and efficient web applications, and I am constantly seeking new challenges to improve my skills. I am committed to excellence and strive to stay up-to-date with the latest technologies and techniques to deliver innovative solutions for clients. With my strong analytical skills, attention to detail, and willingness to take on new challenges, I believe I can be a valuable asset in any team.",
  "resume": {
    "tagline": "👋  I'm a software engineer, product designer.",
    "description": "I have delivered world-class hight availability and performance infrasctructure and well engineered backend services. Well-versed with React, Javascript, NodeJS",
    "experiences": [
      {
        "id": "1",
        "dates": "January 2022 - December 2022",
        "type": "Full Time",
        "position": "Fullstack Engineer at Vixtra",
        "bullets": "Engineered backend microservices in typescript nodejs, created application frontend demo in React js and managed infrastructure in AWS."
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
        "dates": "January 2021 - December 2021",
        "type": "Full Time",
        "position": "Fullstack Engineer at Flora Energia",
        "bullets": "Reponsible for the development of the application frontend, temporary managed infrastructure and engineered backend microservices."
      }
    ],
    "education": {
      "universityName": "Insper Instituto de Ensino e Pesquisa",
      "universityDate": "2018-2023",
      "universityPara": "Bachelor of Computer Engineering"
    },
    "languages": ["Javascript", "HTML5", "CSS", "Python"],
    "frameworks": ["React", "Typescript", "NodeJs", "NextJs"],
    "others": ["AWS"]
  }
}
